#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/unisorter/fileshare-infra/runs/run-iQYnhRWHY52xzhsX

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.s3.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3.module.log_bucket.aws_s3_bucket_policy.this[0] has been changed
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "unisorter-file-share-logs"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ Bool = {
                              ~ aws:SecureTransport = [
                                  - "false",
                                ] -> "false"
                            }
                        }
                        # (5 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }
  # module.s3.module.log_bucket.aws_s3_bucket.this[0] has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share-logs"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.s3.module.s3_bucket.aws_s3_bucket.this[0] has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "log1"
          + tags                                   = {}
            # (3 unchanged attributes hidden)


            # (4 unchanged blocks hidden)
        }



        # (4 unchanged blocks hidden)
    }
  # module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0] has been changed
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "unisorter-file-share"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ Bool = {
                              ~ aws:SecureTransport = [
                                  - "false",
                                ] -> "false"
                            }
                        }
                        # (5 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.s3.aws_kms_key.objects will be created
  + resource "aws_kms_key" "objects" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 30
      + description              = "KMS key is used to encrypt bucket objects"
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
      + tags_all                 = (known after apply)
    }

  # module.s3.module.log_bucket.aws_s3_bucket_public_access_block.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_public_access_block" "this" {
      ~ block_public_acls       = false -> true
      ~ block_public_policy     = false -> true
        id                      = "unisorter-file-share-logs"
      ~ ignore_public_acls      = false -> true
      ~ restrict_public_buckets = false -> true
        # (1 unchanged attribute hidden)
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "2476060572" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = [
                                      - "false",
                                    ]
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::unisorter-file-share/*",
                              - "arn:aws:s3:::unisorter-file-share",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.deny_insecure_transport[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "2476060572" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.s3.module.s3_bucket.aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 7 -> null
          - enabled                                = true -> null
          - id                                     = "log1" -> null
          - prefix                                 = "log1/" -> null
          - tags                                   = {} -> null

          - noncurrent_version_expiration {
              - days = 300 -> null
            }

          - noncurrent_version_transition {
              - days          = 30 -> null
              - storage_class = "STANDARD_IA" -> null
            }
          - noncurrent_version_transition {
              - days          = 60 -> null
              - storage_class = "ONEZONE_IA" -> null
            }
          - noncurrent_version_transition {
              - days          = 90 -> null
              - storage_class = "GLACIER" -> null
            }
        }



      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> false
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "unisorter-file-share"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.


```

</details>

*Pusher: @umangm99, Action: `pull_request`*